{
  "common": {
    "name": "notification-manager",
    "version": "1.1.0",
    "news": {
      "1.1.0": {
        "en": "added possibility to suppress messages\nfixed issue that bottom of settings page is shown behind toolbar\nfixed issue that all notifications are cleared instead of only the handled one",
        "de": "möglichkeit, nachrichten zu unterdrücken\nfest problem, dass unten der einstellungen seite hinter der symbolleiste angezeigt wird\nfestes problem, dass alle benachrichtigungen gelöscht werden, anstatt nur die behandelte",
        "ru": "добавленная возможность подавления сообщений\nфиксированная проблема, что внизу страницы настроек показано за панелью инструментов\nфиксированный вопрос о том, что все уведомления очистятся вместо только обработанного",
        "pt": "possibilidade adicionada de suprimir mensagens\nproblema fixo que a parte inferior da página de configurações é mostrada atrás da barra de ferramentas\nproblema fixo que todas as notificações são compensadas em vez de apenas uma",
        "nl": "toegevoegd mogelijkheid om berichten te onderdrukken\nvast probleem dat de onderkant van de instellingen pagina wordt weergegeven achter de werkbalk\nvast probleem dat alle meldingen worden gewist in plaats van alleen de afgehandelde",
        "fr": "possibilité supplémentaire de supprimer les messages\nproblème corrigé que le bas de la page de paramètres est affiché derrière la barre d'outils\nproblème fixe que toutes les notifications sont effacées au lieu de la seule traitée",
        "it": "possibilità aggiunta di sopprimere i messaggi\nproblema fisso che il fondo delle impostazioni pagina è mostrato dietro la barra degli strumenti\nproblema fisso che tutte le notifiche sono cancellate invece di solo quella gestita",
        "es": "adicional posibilidad de suprimir mensajes\nedición fija que la parte inferior de la página de configuración se muestra detrás de la barra de herramientas\ncuestión fija de que todas las notificaciones se despejen en lugar de sólo el manejado",
        "pl": "dodana możliwość tłumienia wiadomości\nstałe wydanie, że dół strony ustawień jest wyświetlany za paskiem narzędzi\nstała kwestia, że wszystkie powiadomienia są rozliczane zamiast tylko obsługiwane",
        "uk": "можливість пригнічувати повідомлення\nвиправлено проблему, що дно сторінки налаштувань відображається за допомогою панелі інструментів\nвиправлено проблему, що всі повідомлення очищаються замість того, щоб впоратися один",
        "zh-cn": "增加了压制信息的可能性\n设置页面底部显示在工具栏后面的固定问题\n固定问题,即所有通知都已清除,而不只是处理过的通知"
      },
      "1.0.0": {
        "en": "added possibility to send custom messages\nadded UI indicators for each category",
        "de": "möglichkeit, benutzerdefinierte nachrichten zu senden\nuI-Indikatoren für jede Kategorie hinzugefügt",
        "ru": "добавлена возможность отправки пользовательских сообщений\nдобавлены показатели UI для каждой категории",
        "pt": "possibilidade adicionada de enviar mensagens personalizadas\nadicionado indicadores UI para cada categoria",
        "nl": "voegde de mogelijkheid toe om gebruikelijke berichten te sturen\nvoegde UI indicatoren toe voor elke categorie",
        "fr": "possibilité supplémentaire d'envoyer des messages personnalisés\ndes indicateurs UI ajoutés pour chaque catégorie",
        "it": "possibilità aggiunta di inviare messaggi personalizzati\nindicatori UI aggiunti per ogni categoria",
        "es": "añadido posibilidad de enviar mensajes personalizados\nindicadores UI añadidos para cada categoría",
        "pl": "dostarczać możliwość przesyłania danych docelowych\ndodano wskaźniki UI dla każdej kategorii",
        "uk": "додано можливість надсилати спеціальні повідомлення\nдодано UI показники для кожної категорії",
        "zh-cn": "发出习惯信息的可能性\n增加每个类别UI指标"
      },
      "0.1.2": {
        "en": "also show notifications provided by adapters in the configuration",
        "de": "auch meldungen von adaptern in der konfiguration anzeigen",
        "ru": "также показывают уведомления, предоставленные адаптерами в конфигурации",
        "pt": "também mostrar notificações fornecidas por adaptadores na configuração",
        "nl": "laat ook berichten zien door adapters in de configuratie",
        "fr": "afficher également les notifications fournies par les adaptateurs dans la configuration",
        "it": "anche mostrare le notifiche fornite dagli adattatori nella configurazione",
        "es": "también mostrar notificaciones proporcionadas por los adaptadores en la configuración",
        "pl": "wykazuje również powiadomienia dostarczone przez adapterów w konfiguracji",
        "uk": "також показати повідомлення, що надаються адаптерами в конфігурації",
        "zh-cn": "组合的适应者也发出通知"
      },
      "0.1.1": {
        "en": "added possibility to send test messages from web interface (closes #1)",
        "de": "zusätzliche möglichkeit, testnachrichten von der web-schnittstelle zu senden (schließt #1)",
        "ru": "добавлена возможность отправки тестовых сообщений из веб-интерфейса (closes #1)",
        "pt": "possibilidade adicionada de enviar mensagens de teste da interface web (fecha #1)",
        "nl": "toegevoegd de mogelijkheid om test berichten te sturen van web interface (closes)",
        "fr": "possibilité supplémentaire d'envoyer des messages de test depuis l'interface web (ferme #1)",
        "it": "possibilità aggiunta di inviare messaggi di prova dall'interfaccia web (chiude #1)",
        "es": "añadido posibilidad de enviar mensajes de prueba desde la interfaz web (closes #1)",
        "pl": "dodano możliwość przesyłania wiadomości z interfejsu internetowego (zawiera 1)",
        "uk": "можливість надсилати тестові повідомлення з веб-інтерфейсу (закриває #1)",
        "zh-cn": "网络界传送试验信息的可能性(编号:#1)"
      },
      "0.1.0": {
        "en": "initial release",
        "de": "erstausstrahlung",
        "ru": "начальный выпуск",
        "pt": "lançamento inicial",
        "nl": "niet",
        "fr": "initial release",
        "it": "rilascio iniziale",
        "es": "liberación inicial",
        "pl": "pierwsze wydanie",
        "uk": "початковий реліз",
        "zh-cn": "初步释放"
      },
      "0.0.1": {
        "en": "initial release",
        "de": "Erstveröffentlichung",
        "ru": "Начальная версия",
        "pt": "lançamento inicial",
        "nl": "Eerste uitgave",
        "fr": "Première version",
        "it": "Versione iniziale",
        "es": "Versión inicial",
        "pl": "Pierwsze wydanie",
        "uk": "Початкова версія",
        "zh-cn": "首次出版"
      }
    },
    "title": "Notification Manager",
    "titleLang": {
      "en": "Notification Manager",
      "de": "Benachrichtigungsmanager",
      "ru": "Менеджер уведомлений",
      "pt": "Gerenciador de notificações",
      "nl": "Meldingsbeheerder",
      "fr": "Gestionnaire de notifications",
      "it": "Responsabile delle notifiche",
      "es": "Administrador de notificaciones",
      "pl": "Menedżer powiadomień",
      "uk": "Менеджер сповіщень",
      "zh-cn": "通知管理器"
    },
    "desc": {
      "en": "Manage ioBroker notifications, e.g. by sending them as messages",
      "de": "Verwalten Sie ioBroker-Benachrichtigungen, z. indem Sie sie als Nachrichten versenden",
      "ru": "Управление уведомлениями ioBroker, например. отправив их в виде сообщений",
      "pt": "Gerenciar notificações do ioBroker, por exemplo enviando-os como mensagens",
      "nl": "Beheer ioBroker-meldingen, b.v. door ze als berichten te verzenden",
      "fr": "Gérer les notifications ioBroker, par ex. en les envoyant sous forme de messages",
      "it": "Gestisci le notifiche ioBroker, ad es. inviandoli come messaggi",
      "es": "Administre las notificaciones de ioBroker, p. enviándolos como mensajes",
      "pl": "Zarządzaj powiadomieniami ioBroker, np. wysyłając je jako wiadomości",
      "uk": "Керуйте сповіщеннями ioBroker, напр. надсилаючи їх як повідомлення",
      "zh-cn": "管理 ioBroker 通知，例如通过将它们作为消息发送"
    },
    "authors": [
      "foxriver76 <moritz.heusinger@gmail.com>"
    ],
    "keywords": [
      "notifications",
      "messages"
    ],
    "tier": 2,
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "notification-manager.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/foxriver76/ioBroker.notification-manager/main/admin/notification-manager.png",
    "readme": "https://github.com/foxriver76/ioBroker.notification-manager/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "utility",
    "compact": true,
    "connectionType": "local",
    "dataSource": "push",
    "messagebox": true,
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "notifications": [
    {
      "scope": "user",
      "name": {
        "en": "User-specific news",
        "de": "Benutzerspezifische Nachrichten",
        "ru": "Новости для конкретных пользователей",
        "pt": "Notícias específicas do utilizador",
        "nl": "Gebruikersspecifiek nieuws",
        "fr": "Nouvelles spécifiques à l'utilisateur",
        "it": "Notizie specifiche per l'utente",
        "es": "Noticias específicas de los usuarios",
        "pl": "Wiadomości specyficzne dla użytkownika",
        "uk": "Користувацькі новини",
        "zh-cn": "特定用户新闻"
      },
      "description": {
        "en": "These notifications represent news sent by the user itself.",
        "de": "Bei diesen Meldungen handelt es sich um Nachrichten, die vom Nutzer selbst gesendet werden.",
        "ru": "Эти уведомления представляют собой новости, отправленные самим пользователем.",
        "pt": "Estas notificações representam notícias enviadas pelo próprio utilizador.",
        "nl": "Deze meldingen vertegenwoordigen nieuws dat door de gebruiker zelf is verzonden.",
        "fr": "Ces notifications représentent des nouvelles envoyées par l'utilisateur lui-même.",
        "it": "Queste notifiche rappresentano notizie inviate dall'utente stesso.",
        "es": "Estas notificaciones representan noticias enviadas por el propio usuario.",
        "pl": "Powiadomienia te reprezentują wiadomości wysyłane przez samego użytkownika.",
        "uk": "Ці сповіщення являють собою новини, надіслані самим користувачем.",
        "zh-cn": "这些通知代表用户自己发送的新闻。"
      },
      "categories": [
        {
          "category": "notify",
          "name": {
            "en": "Informal news",
            "de": "Informelle Nachrichten",
            "ru": "Неофициальные новости",
            "pt": "Notícias informais",
            "nl": "Informeel nieuws",
            "fr": "Nouvelles informelles",
            "it": "Notizie informali",
            "es": "Noticias oficiosas",
            "pl": "Nieformalne wiadomości",
            "uk": "Неофіційні новини",
            "zh-cn": "非正式新闻"
          },
          "severity": "notify",
          "description": {
            "en": "These messages represent general news, that the user wants to be informed on the \"notify\" level.",
            "de": "Diese Meldungen stellen allgemeine Nachrichten dar, über die der Nutzer auf der Ebene \"Benachrichtigung\" informiert werden möchte.",
            "ru": "Эти сообщения представляют собой общие новости, о которых пользователь хочет быть проинформирован на уровне \"уведомлять\".",
            "pt": "Estas mensagens representam notícias gerais, de que o utilizador pretende ser informado ao nível da \"notificação\".",
            "nl": "Deze berichten vertegenwoordigen algemeen nieuws waarvan de gebruiker op de hoogte wil worden gebracht op het niveau \"kennisgeving\".",
            "fr": "Ces messages représentent des nouvelles générales dont l'utilisateur souhaite être informé au niveau \"notifier\".",
            "it": "Questi messaggi rappresentano notizie generali, di cui l'utente vuole essere informato a livello di \"notifica\".",
            "es": "Estos mensajes representan noticias generales de las que el usuario desea estar informado a nivel de \"notificación\".",
            "pl": "Wiadomości te reprezentują ogólne wiadomości, o których użytkownik chce być informowany na poziomie \"powiadomienia\".",
            "uk": "Ці повідомлення представляють загальні новини, про які користувач хоче бути поінформованим на рівні \"сповіщення\".",
            "zh-cn": "这些信息代表一般新闻，用户希望在 \"通知 \"级别上获知。"
          },
          "regex": [],
          "limit": 100
        },
        {
          "category": "info",
          "name": {
            "en": "Important news",
            "de": "Wichtige Nachrichten",
            "ru": "Важные новости",
            "pt": "Notícias importantes",
            "nl": "Belangrijk nieuws",
            "fr": "Nouvelles importantes",
            "it": "Notizie importanti",
            "es": "Noticias importantes",
            "pl": "Ważne wiadomości",
            "uk": "Важливі новини",
            "zh-cn": "重要新闻"
          },
          "severity": "info",
          "description": {
            "en": "These messages represent general news, that the user wants to be informed on the \"info\" level.",
            "de": "Diese Meldungen stellen allgemeine Nachrichten dar, über die der Nutzer auf der \"Info\"-Ebene informiert werden möchte.",
            "ru": "Эти сообщения представляют собой общие новости, о которых пользователь хочет быть проинформирован на уровне \"info\".",
            "pt": "Estas mensagens representam notícias gerais, sobre as quais o utilizador pretende ser informado ao nível da \"informação\".",
            "nl": "Deze berichten vertegenwoordigen algemeen nieuws dat de gebruiker op \"info\"-niveau wil weten.",
            "fr": "Ces messages représentent des nouvelles générales dont l'utilisateur souhaite être informé au niveau \"info\".",
            "it": "Questi messaggi rappresentano notizie generali, di cui l'utente vuole essere informato a livello \"informativo\".",
            "es": "Estos mensajes representan noticias generales, de las que el usuario quiere estar informado a nivel \"info\".",
            "pl": "Wiadomości te reprezentują ogólne wiadomości, o których użytkownik chce być informowany na poziomie \"info\".",
            "uk": "Ці повідомлення представляють загальні новини, про які користувач хоче бути поінформованим на \"інформаційному\" рівні.",
            "zh-cn": "这些信息代表一般新闻，用户希望从 \"信息 \"层面了解这些信息。"
          },
          "regex": [],
          "limit": 100
        },
        {
          "category": "alert",
          "name": {
            "en": "Alarming news",
            "de": "Alarmierende Nachrichten",
            "ru": "Тревожные новости",
            "pt": "Notícias alarmantes",
            "nl": "Alarmerend nieuws",
            "fr": "Des nouvelles alarmantes",
            "it": "Notizie allarmanti",
            "es": "Noticias alarmantes",
            "pl": "Alarmujące wiadomości",
            "uk": "Тривожні новини",
            "zh-cn": "令人震惊的消息"
          },
          "severity": "alert",
          "description": {
            "en": "These messages represent general news, that the user wants to be informed on the \"alert\" level.",
            "de": "Diese Meldungen stellen allgemeine Nachrichten dar, über die der Nutzer auf der Stufe \"Achtung\" informiert werden möchte.",
            "ru": "Эти сообщения представляют собой общие новости, о которых пользователь хочет быть проинформирован на уровне \"тревоги\".",
            "pt": "Estas mensagens representam notícias gerais, sobre as quais o utilizador pretende ser informado ao nível de \"alerta\".",
            "nl": "Deze berichten vertegenwoordigen algemeen nieuws waarvan de gebruiker op de hoogte wil blijven op het niveau \"alert\".",
            "fr": "Ces messages représentent des nouvelles générales dont l'utilisateur souhaite être informé au niveau \"alerte\".",
            "it": "Questi messaggi rappresentano notizie di carattere generale, di cui l'utente vuole essere informato a livello di \"allarme\".",
            "es": "Estos mensajes representan noticias generales de las que el usuario desea estar informado en el nivel de \"alerta\".",
            "pl": "Wiadomości te reprezentują ogólne wiadomości, o których użytkownik chce być informowany na poziomie \"alertu\".",
            "uk": "Ці повідомлення представляють загальні новини, про які користувач хоче бути поінформованим на рівні \"оповіщення\".",
            "zh-cn": "这些信息代表一般新闻，用户希望在 \"警报 \"级别上获知。"
          },
          "regex": [],
          "limit": 100
        }
      ]
    }
  ],
  "native": {
    "categories": {},
    "fallback": {
      "info": {
        "firstAdapter": "",
        "secondAdapter": ""
      },
      "notify": {
        "firstAdapter": "",
        "secondAdapter": ""
      },
      "alert": {
        "firstAdapter": "",
        "secondAdapter": ""
      }
    }
  },
  "objects": [],
  "instanceObjects": []
}
